console.log("Module 3 lesson 1");

// 1. Объекты

// --- Создание объекта ---

//! example ---------------------

//!!! task ------------------------
// Создайте объект cart. Добавьте в объект поля со следующими данными:
//     продукты - массив;
//     общее количество - число;
//     общая цена - число; 


// --- Доступ к свойствам ---
//! example ---------------------

//!!! task ------------------------
// const user = {
//     id: "132ghghj4234ghg34",
//     name: "Alex",
//     age: 25,
//     status: "student",
//     isOnline: true,
// }
// Выведите в консоль элементы с ключами 'name', 'age', 'status' двумя способами: 
//     через квадратные скобки;
//     как свойство объекта.
//  Если пользователь активный (isOnline) выведите в консоль 
// "Пользователь находится в сети" иначе "Пользователь не в сети"

// --- Удаление свойств ---
//! example ---------------------

//!!! task ------------------------
// const user = {
//     id: "132ghghj4234ghg34",
//     name: "Alex",
//     age: 25,
//     status: "student",
//     isOnline: true,
// }
// Удалите єлементы "status" и "isOnline"


// --- Отсутствующие свойства ---
//! example ---------------------


// --- Короткие свойства ---
//! example ---------------------

//!!! task ------------------------
// const name = "Alex";
// const age = 25;
// Используя короткие свойства объектов создайте объект с полями "name", "age";


// --- Вычисляемые свойства ---
//! example ---------------------


//!!! task ------------------------
// const user = {
//     id: "132ghghj4234ghg34",
//     name: "Alex",
//     age: 25,
//     status: "student",
//     isOnline: true,
// }
// Выведите в консоль значения свойств объекта по ключам, которые находятся в массиве:
// ["name", "age", "status"]


// --- Методы объекта ---
//! example ---------------------

//!!! task ------------------------
// const user = {
//     id: "132ghghj4234ghg34",
//     name: "Alex",
//     age: 25,
//     status: "student",
//     isOnline: true,
// }
// Добавьте в объект user метод sayHello, который выводит в консоль приветствие: "Hello"
// Выведите в консоль результат


// --- Доступ к объекту через this ---
//! example ---------------------

//!!! task ------------------------
// const user = {
//     id: "132ghghj4234ghg34",
//     name: "Alex",
//     age: 25,
//     status: "student",
//     isOnline: true,
// }
// Добавьте в объект user метод sayHello, который выводит всю информацию о пользователе.
// Используйте console.group()


//!!! task ------------------------
// Создайте объект cart. Добавьте в объект поля со следующими данными:
//     продукты - массив;
//     общее количество - число;
//     общая цена - число; 
// добавьте в корзину ( в поле products) несколько товаров(объектов);
// Создайте метод, который подсчитывает количество товаров в корзине и общую сумму.
// создайте метод, который логирует все продукты корзины 



// --------------------------------------------------------------------
// 2. Перебор объекта

// --- Цикл for...in ---

// --- Object.keys(), Object.values(), Object.entries() ---
// ----------------------------------------------------------------------

// 3. Операция spread и rest

// --- Операция spread ---
// --- Распыление аргументов ---

// --- Распыление массивов ---

// --- Распыление объектов ---

// --- Операция rest ---

// ------------------------------------------------------------------
// 4. Деструктуризация

// --- Деструктуризация объектов ---

// --- Деструктуризация массивов ---